performance-test.yml
config:
  target: '{{ $processEnvironment.TARGET_URL }}'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 100
      name: "Stress test"

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/v1/health"

  - name: "User Authentication"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@example.com"
            password: "Test123!@#"

  - name: "Exam Operations"
    weight: 25
    flow:
      - get:
          url: "/api/v1/exams"
      - get:
          url: "/api/v1/exams/507f1f77bcf86cd799439011"

  - name: "Dashboard Access"
    weight: 25
    flow:
      - get:
          url: "/api/v1/admin/dashboard"
          headers:
            Authorization: "Bearer {{ token }}"